# 04Debug
'''
使用左侧边栏的Debug按钮，设置断点，运行程序，观察程序运行过程。
'''
name = 'Tom'
age = 18
address = '北京'

# 格式化输出：
'''
1. %格式化输出
2. .format格式化输出
3. f字符串格式化输出
'''
'''1. %格式化输出:
%s，代表字符串
%d，数字
%f，浮点数
%c，代表字符
%u，代表无符号整数
%x，代表十六进制
%o，代表八进制
%e，%E代表科学计数法
%%，代表百分号                  <=====
'''
# \n是换行
print('姓名：%s\n年龄：%d\n地址：%s\n' % (name, age, address))
print("-------------------这是%格式化输出-------------------")

'''2. .format格式化输出:
{}代表占位符
'''
print('姓名：{0}\n年龄：{1}\n地址：{2}\n'.format(name, age, address))
print("-------------------这是.format格式化输出-------------------")

'''3. f字符串格式化输出:
f
'''
print(f'姓名：{name}\n年龄：{age}\n地址：{address}')
print("-------------------这是f字符串格式化输出-------------------")

# 相同效果
print('姓名：' + name + '\n年龄：' + str(age) + '\n地址：' + address)
print('姓名：'+ name)
print('年龄：'+ str(age))
print('地址：'+ address)
print("-------------------这是普通输出-------------------")