# 15列表操作
list1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(list1)
list1.append(11)
print(list1)
print("========================这是列表添加后的结果==========================")

# 列表插入、删除、修改、查找、排序、翻转、清空、切片、索引、长度、遍历

list1.insert(0, 0) # 在列表的第一个位置插入0
print(list1)
print("========================这是列表插入后的结果==========================")

list1.pop() # 删除列表的最后一个元素
print(list1)
list1.pop(0) # 删除列表的第一个元素
print(list1)
list1.remove(3) # 删除列表中值为3的元素
print(list1)
list1.clear() # 列表清空，内存释放
print(list1)
print("========================这是列表删除后的结果==========================")

list1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10] # 列表重新赋值
list1.reverse() # 列表反转
print(list1)
list1.sort() # 列表排序
print(list1)
list1.sort(reverse=True) # 列表倒序
print(list1)
print("========================这是列表排序后的结果==========================")


print(list1[0]) # 索引0
print(list1[-1]) # 索引-1
print(list1[1:5]) # 从第一个元素开始到第五个元素结束
print(list1[1:]) # 从第一个元素开始到最后一个元素结束
print(list1[:5]) # 从第一个元素开始到第五个元素结束
list1[0] = 1 # 修改列表中索引为0的值为1
print(list1)
print("========================这是列表索引修改后的结果==========================")

# 列表长度
print(len(list1))
print("========================这是列表长度的结果==========================")

for i in list1: # 遍历列表
    print(i)
    if i == 5: # 判断列表中的值是否为5
        print("找到了5")
        break
    else:
        print("没找到5")
        continue
    print("循环结束")

print("========================这是列表遍历的结果==========================")

# 列表的嵌套
list1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10] 
list2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
list3 = [list1, list2]
print(list3) # 列表嵌套
print(list3[0]) # 索引0
print(list3[0][0]) 
print(list3[0][0:5]) 
print("========================这是列表的嵌套结果==========================")